#+title:      B Klasse 2023-27
#+date:       [2023-07-08 Sa 14:39]
#+filetags:   :1b:Project:
#+identifier: 20230708T143945
#+CATEGORY: golling

* Jahresplanung
[[denote:20230621T073313][01 Golling]]

* 1b 12:30-13:20
<%%(org-class 2023 9 12 2024 7 6 2)>


* 1b 07:45-08:35
<%%(org-class 2023 9 15 2024 7 9 5)>


* 1B [KV Gertraud Viertbauer]
#+Name: 2021-students
| First     | Last          | Name                 | Note | Mitarbeit | Heft | LZK |
|-----------+---------------+----------------------+------+-----------+------+-----|
| Julia     | Anthofer      | [[Julia Anthofer][Julia Anthofer]]       |      |           |      |     |
| Marko     | Davidovic     | [[Marko Davidovic][Marko Davidovic]]      |    1 |           |      |     |
| Simon     | Hager         | [[Simon Hager][Simon Hager]]          |      |           |      |     |
| Emma      | Hansmann      | [[Emma Hansmann][Emma Hansmann]]        |    1 |           |      |     |
| Magdalena | Höllbacher    | [[Magdalena Höllbacher][Magdalena Höllbacher]] |    1 |           |      |     |
| Julia     | Höllweger     | [[Julia Höllweger][Julia Höllweger]]      |    1 |           |      |     |
| Rudolf    | Jochinger     | [[Rudolf Jochinger][Rudolf Jochinger]]     |    1 |           |      |     |
| Laura     | Klausner      | [[Laura Klausner][Laura Klausner]]       |    1 |           |      |     |
| Sophia    | Korten        | [[Sophia Korten][Sophia Korten]]        |    1 |           |      |     |
| Lisa      | Kronreif      | [[Lisa Kronreif][Lisa Kronreif]]        |    1 |           |      |     |
| Peter     | Kronreif      | [[Peter Kronreif][Peter Kronreif]]       |    1 |           |      |     |
| Anna-Mae  | Leierer       | [[Anna-Mae Leierer][Anna-Mae Leierer]]     |    1 |           |      |     |
| Mira      | Meißner       | [[Mira Meißner][Mira Meißner]]         |      |           |      |     |
| Neureiter | Benjamin      | [[Neureiter Benjamin][Neureiter Benjamin]]   |      |           |      |     |
| Paula     | Neureiter     | [[Paula Neureiter][Paula Neureiter]]      |      |           |      |     |
| Raphael   | Neureiter     | [[Raphael Neureiter][Raphael Neureiter]]    |    1 |           |      |     |
| Sebastian | Neureiter     | [[Sebastian Neureiter][Sebastian Neureiter]]  |      |           |      |     |
| Sophie    | Schieferer    | [[Sophie Schieferer][Sophie Schieferer]]    |      |           |      |     |
| Klara     | Schmitzberger | [[Klara Schmitzberger][Klara Schmitzberger]]  |    1 |           |      |     |
| Elisabeth | Seigmann      | [[Elisabeth Seigmann][Elisabeth Seigmann]]   |    1 |           |      |     |
| Bianca    | Spagolla      | [[Bianca Spagolla][Bianca Spagolla]]      |    1 |           |      |     |
| Pia       | Stoß          | [[Pia Stoß][Pia Stoß]]             |      |           |      |     |
| Valentin  | Walcher       | [[Valentin Walcher][Valentin Walcher]]     |      |           |      |     |
| Vincent   | Walcher       | [[Vincent Walcher][Vincent Walcher]]      |      |           |      |     |
| Illija    | Zivkovic      | [[Illija Zivkovic][Illija Zivkovic]]      |      |           |      |     |
|-----------+---------------+----------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(2021-22-Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':END: ')
      print('\n\n')
#+END_SRC

#+RESULTS:
* Mitarbeit

# In diese Tabelle trage ich die Mitarbeit während 10 Schulwochen ein. Danach kann ich mit der ersten Tabellenformel die aktuelle Durchschnittsnote errechnen. Diese kann ich in die obige Tabelle übernehmen. Nach 23 Wochen (dh einem Semster) müsste ich die Tabelle wieder leeren - hm, gibt es keine bessere Lösung? Eine Tabelle mit allen 43 Schulwochen wäre zu groß. Mit 'C-c TAB' kann ich einzelne Spalten ein- und ausklappen. Wie geht das mit mehreren Spalten?
#+Name: Mitarbeit
| Name                 | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 |
|----------------------+------+---+---+---+---+---+---+---+---+---+----+----|
| [[Julia Anthofer][Julia Anthofer]]       |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Marko Davidovic][Marko Davidovic]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Simon Hager][Simon Hager]]          |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Emma Hansmann][Emma Hansmann]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Magdalena Höllbacher][Magdalena Höllbacher]] |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Julia Höllweger][Julia Höllweger]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Rudolf Jochinger][Rudolf Jochinger]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Laura Klausner][Laura Klausner]]       |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Sophia Korten][Sophia Korten]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Lisa Kronreif][Lisa Kronreif]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Peter Kronreif][Peter Kronreif]]       |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Anna-Mae Leierer][Anna-Mae Leierer]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Mira Meißner][Mira Meißner]]         |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Neureiter Benjamin][Neureiter Benjamin]]   |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Paula Neureiter][Paula Neureiter]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Raphael Neureiter][Raphael Neureiter]]    |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Sebastian Neureiter][Sebastian Neureiter]]  |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Sophie Schieferer][Sophie Schieferer]]    |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Klara Schmitzberger][Klara Schmitzberger]]  |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Elisabeth Seigmann][Elisabeth Seigmann]]   |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Bianca Spagolla][Bianca Spagolla]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Pia Stoß][Pia Stoß]]             |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Valentin Walcher][Valentin Walcher]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Vincent Walcher][Vincent Walcher]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Illija Zivkovic][Illija Zivkovic]]      |      |   |   |   |   |   |   |   |   |   |    |    |
#+TBLFM: $2=vmean($3..$>)
#+TBLFM: $1='(identity remote(2021-students,@@#$3))

** Julia Anthofer
:PROPERTIES:
:EMAIL: [[mailto: Julia Anthofer <Julia.Anthofer@golling.schule>]]
:END: 



** Marko Davidovic
:PROPERTIES:
:EMAIL: [[mailto: Marko Davidovic <Marko.Davidovic@golling.schule>]]
:END: 



** Simon Hager
:PROPERTIES:
:EMAIL: [[mailto: Simon Hager <Simon.Hager@golling.schule>]]
:END: 



** Emma Hansmann
:PROPERTIES:
:EMAIL: [[mailto: Emma Hansmann <Emma.Hansmann@golling.schule>]]
:END: 



** Magdalena Höllbacher
:PROPERTIES:
:EMAIL: [[mailto: Magdalena Höllbacher <Magdalena.Höllbacher@golling.schule>]]
:END: 



** Julia Höllweger
:PROPERTIES:
:EMAIL: [[mailto: Julia Höllweger <Julia.Höllweger@golling.schule>]]
:END: 



** Rudolf Jochinger
:PROPERTIES:
:EMAIL: [[mailto: Rudolf Jochinger <Rudolf.Jochinger@golling.schule>]]
:END: 



** Laura Klausner
:PROPERTIES:
:EMAIL: [[mailto: Laura Klausner <Laura.Klausner@golling.schule>]]
:END: 



** Sophia Korten
:PROPERTIES:
:EMAIL: [[mailto: Sophia Korten <Sophia.Korten@golling.schule>]]
:END: 



** Lisa Kronreif
:PROPERTIES:
:EMAIL: [[mailto: Lisa Kronreif <Lisa.Kronreif@golling.schule>]]
:END: 



** Peter Kronreif
:PROPERTIES:
:EMAIL: [[mailto: Peter Kronreif <Peter.Kronreif@golling.schule>]]
:END: 



** Anna-Mae Leierer
:PROPERTIES:
:EMAIL: [[mailto: Anna-Mae Leierer <Anna-Mae.Leierer@golling.schule>]]
:END: 



** Mira Meißner
:PROPERTIES:
:EMAIL: [[mailto: Mira Meißner <Mira.Meißner@golling.schule>]]
:END: 



** Neureiter Benjamin
:PROPERTIES:
:EMAIL: [[mailto: Neureiter Benjamin <Neureiter.Benjamin@golling.schule>]]
:END: 



** Paula Neureiter
:PROPERTIES:
:EMAIL: [[mailto: Paula Neureiter <Paula.Neureiter@golling.schule>]]
:END: 



** Raphael Neureiter
:PROPERTIES:
:EMAIL: [[mailto: Raphael Neureiter <Raphael.Neureiter@golling.schule>]]
:END: 



** Sebastian Neureiter
:PROPERTIES:
:EMAIL: [[mailto: Sebastian Neureiter <Sebastian.Neureiter@golling.schule>]]
:END: 



** Sophie Schieferer
:PROPERTIES:
:EMAIL: [[mailto: Sophie Schieferer <Sophie.Schieferer@golling.schule>]]
:END: 



** Klara Schmitzberger
:PROPERTIES:
:EMAIL: [[mailto: Klara Schmitzberger <Klara.Schmitzberger@golling.schule>]]
:END: 



** Elisabeth Seigmann
:PROPERTIES:
:EMAIL: [[mailto: Elisabeth Seigmann <Elisabeth.Seigmann@golling.schule>]]
:END: 



** Bianca Spagolla
:PROPERTIES:
:EMAIL: [[mailto: Bianca Spagolla <Bianca.Spagolla@golling.schule>]]
:END: 



** Pia Stoß
:PROPERTIES:
:EMAIL: [[mailto: Pia Stoß <Pia.Stoß@golling.schule>]]
:END: 



** Valentin Walcher
:PROPERTIES:
:EMAIL: [[mailto: Valentin Walcher <Valentin.Walcher@golling.schule>]]
:END: 



** Vincent Walcher
:PROPERTIES:
:EMAIL: [[mailto: Vincent Walcher <Vincent.Walcher@golling.schule>]]
:END: 



** Illija Zivkovic
:PROPERTIES:
:EMAIL: [[mailto: Illija Zivkovic <Illija.Zivkovic@golling.schule>]]
:END: 


* Reflexionen

